app/views/users/show.html.erb

<div class="col-md-8">
    <% if @user.challenges.any? %>
---
SELECT  1 AS one FROM "challenges" INNER JOIN "relationships" ON "challenges"."id" = "relationships"."Challenge_id" WHERE "relationships"."user_id" = ? LIMIT 1  [["user_id", 762146112]]