app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "challenges" INNER JOIN "relationships" ON "challenges"."id" = "relationships"."challenge_id" WHERE "relationships"."user_id" = ?  [["user_id", 1]]
---
<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.challenges.count, "challenge") %></span>