app/views/challenges/_challenge.html.erb


<% if current_user?(challenge.users.first) %>
---
SELECT "users".* FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."challenge_id" = ?  [["challenge_id", 85]]