app/controllers/challenges_controller.rb

INSERT INTO "challenges" ("task", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["task", "Testing challenge"], ["user_id", 1], ["created_at", "2015-03-29 01:44:05.792325"], ["updated_at", "2015-03-29 01:44:05.792325"]]
---
  def create
  	@challenge = current_user.challenges.build(challenge_params)
    @challenges.users << current_user

DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 301]]
---
  def destroy
  	@challenge.destroy